budget-tracker-api/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    render json: @user, adapter: :attributes, status: 201 if @user.save