app/controllers/api/v1/budget_totals_controller.rb

  def index
    @budget = Budget.find(params[:budget_id])
    @budget_totals = @budget.budget_totals.all
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "budget_totals".* FROM "budget_totals" WHERE "budget_totals"."budget_id" = $1  [["budget_id", 1]]

  def show
    @budget = Budget.find(params[:budget_id])
    @budget_total = @budget.budget_totals.find_by(id: params[:id])
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @budget = Budget.find(params[:budget_id])
    @budget_total = @budget.budget_totals.build(budget_total_params)
    if @budget_total.save
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "budget_totals" ("budget_id", "date", "rent", "transport", "food", "entertainment", "utilities", "other", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    @budget = Budget.find(params[:budget_id])
    @budget_total = @budget.budget_totals.find_by(id: params[:id]) if @budget
    @budget_total.destroy
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "budget_totals".* FROM "budget_totals" WHERE "budget_totals"."budget_id" = $1 AND "budget_totals"."id" = $2 LIMIT $3  [["budget_id", 1], ["id", 5], ["LIMIT", 1]]
DELETE FROM "budget_totals" WHERE "budget_totals"."id" = $1  [["id", 5]]